app/controllers/courses_controller.rb

  def index
    @courses = Course.all()
---
SELECT `courses`.* FROM `courses`

  def create
    @course = Course.new(require_params)

    @course.user_id = current_user.id
    if @course.save
---
INSERT INTO `courses` (`title`, `image`, `user_id`, `created_at`, `updated_at`) VALUES ('Rails', '1.jpg', 5, '2016-04-28 08:28:41', '2016-04-28 08:28:41')