app/controllers/lectures_controller.rb

  def create
    @lecture = Lecture.new(require_params)
    @lecture.user_id = current_user.id

    if @lecture.save
---
INSERT INTO `lectures` (`title`, `content`, `course_id`, `user_id`, `created_at`, `updated_at`) VALUES ('1- Security Fundamentals', '<p><strong>our first lecture is going&nbsp;</strong>to be a high evaluated on your <em>participation</em></p>\r\n', 2, 5, '2016-04-28 10:23:05', '2016-04-28 10:23:05')